# Тема “Работа с данными в Pandas”

**Задание 1.**

Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [104]:
import pandas as pd

In [105]:
authors = pd.DataFrame({
    'authors_id': [1, 2, 3],
    'authors_name': ['Тургенев', 'Чехов', 'Островский']
})
authors

   authors_id authors_name
0           1     Тургенев
1           2        Чехов
2           3   Островский

In [106]:
book = pd.DataFrame({
    'authors_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Талаты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290]
})
book

   authors_id           book_title  price
0           1          Отцы и дети    450
1           1                Рудин    300
2           1    Дворянское гнездо    350
3           2     Толстый и тонкий    500
4           2      Дама с собачкой    450
5           3                Гроза    370
6           3  Талаты и поклонники    290

**Задание 2.**

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [107]:
authors_price = pd.merge(authors, book, how='outer', on='authors_id')
authors_price

   authors_id authors_name           book_title  price
0           1     Тургенев          Отцы и дети    450
1           1     Тургенев                Рудин    300
2           1     Тургенев    Дворянское гнездо    350
3           2        Чехов     Толстый и тонкий    500
4           2        Чехов      Дама с собачкой    450
5           3   Островский                Гроза    370
6           3   Островский  Талаты и поклонники    290

**Задание 3.**

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [108]:
top5 = authors_price.nlargest(5, 'price')
top5

   authors_id authors_name         book_title  price
3           2        Чехов   Толстый и тонкий    500
0           1     Тургенев        Отцы и дети    450
4           2        Чехов    Дама с собачкой    450
5           3   Островский              Гроза    370
2           1     Тургенев  Дворянское гнездо    350

**Задание 4.**

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [114]:
# вариант 1
# authors_stats_ = authors_price.groupby('authors_name')
# authors_stats = pd.DataFrame({
#     'min_price': authors_stats_['price'].min(),
#     'max_price': authors_stats_['price'].max(),
#     'mean_price': authors_stats_['price'].mean()
# })
# authors_stats.reset_index(inplace=True)

# вариант 2
authors_stats = authors_price.groupby('authors_name').agg({'price': ['min', 'max', 'mean']})
authors_stats.columns = [col1 + '_' + col0 for col0, col1 in authors_stats.columns]
authors_stats.reset_index(inplace=True)

# вариант 3
# authors_stats = authors_price.groupby('authors_name').agg({'price': ['min', 'max', 'mean']})
# authors_stats.rename(columns={'min': 'min_price', 'max': 'max_price', 'mean': 'mean_price'}, inplace=True)
# authors_stats.columns = authors_stats.columns.get_level_values(1)
# authors_stats.reset_index(inplace=True)

authors_stats

  authors_name  min_price  max_price  mean_price
0   Островский        290        370  330.000000
1     Тургенев        300        450  366.666667
2        Чехов        450        500  475.000000

**Задание 5.**

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [115]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   authors_id authors_name           book_title  price    cover
0           1     Тургенев          Отцы и дети    450  твердая
1           1     Тургенев                Рудин    300   мягкая
2           1     Тургенев    Дворянское гнездо    350   мягкая
3           2        Чехов     Толстый и тонкий    500  твердая
4           2        Чехов      Дама с собачкой    450  твердая
5           3   Островский                Гроза    370   мягкая
6           3   Островский  Талаты и поклонники    290   мягкая

In [116]:
?pd.pivot_table

In [136]:
book_info = pd.pivot_table(authors_price, values='price', index='authors_name', columns='cover', aggfunc='sum', fill_value=0)
book_info

cover         мягкая  твердая
authors_name
Островский       660        0
Тургенев         650      450
Чехов              0      950

In [121]:
book_info.to_pickle("book_info.pkl")

In [122]:
book_info2 = pd.read_pickle("book_info.pkl")
book_info2

cover         мягкая  твердая
authors_name
Островский       660        0
Тургенев         650      450
Чехов              0      950

In [137]:
assert book_info.equals(book_info2)